docs: se utiliza diagramas mermaid para representar mejor la arquitectura distribuida recomendada
